benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-3-60.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.445ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.432ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.45ms    1.14ms   7.01ms   95.81%
    Req/Sec    30.76     57.70   222.00     74.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.22ms
 75.000%    1.38ms
 90.000%    1.62ms
 99.000%    7.01ms
 99.900%   15.09ms
 99.990%   17.93ms
 99.999%   17.93ms
100.000%   17.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.907     0.000000            1         1.00
       1.052     0.100000          298         1.11
       1.094     0.200000          590         1.25
       1.136     0.300000          885         1.43
       1.176     0.400000         1184         1.67
       1.218     0.500000         1469         2.00
       1.242     0.550000         1616         2.22
       1.268     0.600000         1761         2.50
       1.300     0.650000         1907         2.86
       1.337     0.700000         2057         3.33
       1.382     0.750000         2202         4.00
       1.402     0.775000         2274         4.44
       1.429     0.800000         2347         5.00
       1.465     0.825000         2420         5.71
       1.501     0.850000         2494         6.67
       1.548     0.875000         2567         8.00
       1.584     0.887500         2605         8.89
       1.621     0.900000         2640        10.00
       1.669     0.912500         2677        11.43
       1.733     0.925000         2714        13.33
       1.894     0.937500         2750        16.00
       1.994     0.943750         2769        17.78
       2.185     0.950000         2787        20.00
       2.543     0.956250         2805        22.86
       2.911     0.962500         2824        26.67
       3.405     0.968750         2843        32.00
       3.745     0.971875         2851        35.56
       4.049     0.975000         2860        40.00
       4.399     0.978125         2869        45.71
       4.719     0.981250         2879        53.33
       5.579     0.984375         2888        64.00
       5.679     0.985938         2892        71.11
       6.099     0.987500         2897        80.00
       6.431     0.989062         2901        91.43
       7.127     0.990625         2906       106.67
       7.583     0.992188         2911       128.00
       7.663     0.992969         2913       142.22
       8.383     0.993750         2916       160.00
       9.055     0.994531         2917       182.86
      10.911     0.995313         2920       213.33
      11.455     0.996094         2922       256.00
      12.135     0.996484         2923       284.44
      12.327     0.996875         2924       320.00
      13.063     0.997266         2925       365.71
      13.391     0.997656         2927       426.67
      14.095     0.998047         2928       512.00
      14.095     0.998242         2928       568.89
      14.359     0.998437         2929       640.00
      14.359     0.998633         2929       731.43
      15.087     0.998828         2930       853.33
      15.215     0.999023         2931      1024.00
      15.215     0.999121         2931      1137.78
      15.215     0.999219         2931      1280.00
      15.215     0.999316         2931      1462.86
      15.959     0.999414         2932      1706.67
      15.959     0.999512         2932      2048.00
      15.959     0.999561         2932      2275.56
      15.959     0.999609         2932      2560.00
      15.959     0.999658         2932      2925.71
      17.935     0.999707         2933      3413.33
      17.935     1.000000         2933          inf
#[Mean    =        1.446, StdDeviation   =        1.141]
#[Max     =       17.920, Total count    =         2933]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3560 requests in 1.00m, 691.84KB read
  Socket errors: connect 0, read 0, write 0, timeout 67
Requests/sec:     59.31
Transfer/sec:     11.53KB