benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-3-800.log
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  4 threads and 200 connections
  Thread calibration: mean lat.: 2.135ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.746ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.775ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.036ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.74ms    1.02ms   7.53ms   96.96%
    Req/Sec     5.68     24.56   111.00     94.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.56ms
 75.000%    1.75ms
 90.000%    1.91ms
 99.000%    7.53ms
 99.900%   13.24ms
 99.990%   13.24ms
 99.999%   13.24ms
100.000%   13.24ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.213     0.000000            1         1.00
       1.336     0.100000           43         1.11
       1.415     0.200000           88         1.25
       1.476     0.300000          129         1.43
       1.522     0.400000          172         1.67
       1.562     0.500000          214         2.00
       1.596     0.550000          238         2.22
       1.625     0.600000          258         2.50
       1.657     0.650000          279         2.86
       1.695     0.700000          300         3.33
       1.752     0.750000          321         4.00
       1.774     0.775000          332         4.44
       1.795     0.800000          343         5.00
       1.824     0.825000          356         5.71
       1.845     0.850000          364         6.67
       1.878     0.875000          375         8.00
       1.894     0.887500          380         8.89
       1.937     0.900000          386        10.00
       1.954     0.912500          391        11.43
       1.983     0.925000          396        13.33
       2.026     0.937500          402        16.00
       2.047     0.943750          404        17.78
       2.183     0.950000          407        20.00
       2.309     0.956250          410        22.86
       2.345     0.962500          412        26.67
       2.685     0.968750          415        32.00
       2.867     0.971875          416        35.56
       3.143     0.975000          418        40.00
       3.173     0.978125          419        45.71
       3.437     0.981250          420        53.33
       5.643     0.984375          422        64.00
       5.643     0.985938          422        71.11
       6.027     0.987500          423        80.00
       7.527     0.989062          424        91.43
       7.527     0.990625          424       106.67
       8.051     0.992188          425       128.00
       8.051     0.992969          425       142.22
       8.231     0.993750          426       160.00
       8.231     0.994531          426       182.86
       8.231     0.995313          426       213.33
      12.399     0.996094          427       256.00
      12.399     0.996484          427       284.44
      12.399     0.996875          427       320.00
      12.399     0.997266          427       365.71
      12.399     0.997656          427       426.67
      13.239     0.998047          428       512.00
      13.239     1.000000          428          inf
#[Mean    =        1.738, StdDeviation   =        1.016]
#[Max     =       13.232, Total count    =          428]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  624 requests in 30.05s, 121.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 2421
Requests/sec:     20.76
Transfer/sec:      4.04KB