benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/jaeger-benchmark-4000.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  5 threads and 900 connections
  Thread calibration: mean lat.: 1472.274ms, rate sampling interval: 6090ms
  Thread calibration: mean lat.: 1543.919ms, rate sampling interval: 5894ms
  Thread calibration: mean lat.: 1532.965ms, rate sampling interval: 5947ms
  Thread calibration: mean lat.: 1362.209ms, rate sampling interval: 5689ms
  Thread calibration: mean lat.: 1463.825ms, rate sampling interval: 5623ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.42s    10.22s   44.37s    64.98%
    Req/Sec   332.93     33.57   397.00     65.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.10s 
 75.000%   23.97s 
 90.000%   31.21s 
 99.000%   44.37s 
 99.900%    0.85m 
 99.990%    0.91m 
 99.999%    0.95m 
100.000%    0.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.895     0.000000            1         1.00
    4079.615     0.100000         8284         1.11
    7483.391     0.200000        16568         1.25
   11083.775     0.300000        24851         1.43
   13787.135     0.400000        33134         1.67
   17104.895     0.500000        41457         2.00
   18350.079     0.550000        45586         2.22
   19546.111     0.600000        49703         2.50
   20938.751     0.650000        53829         2.86
   22478.847     0.700000        57997         3.33
   23969.791     0.750000        62141         4.00
   24887.295     0.775000        64197         4.44
   25804.799     0.800000        66267         5.00
   26869.759     0.825000        68350         5.71
   28065.791     0.850000        70401         6.67
   29458.431     0.875000        72471         8.00
   30277.631     0.887500        73504         8.89
   31211.519     0.900000        74547        10.00
   32145.407     0.912500        75566        11.43
   33193.983     0.925000        76606        13.33
   34537.471     0.937500        77645        16.00
   35192.831     0.943750        78167        17.78
   35848.191     0.950000        78673        20.00
   36732.927     0.956250        79186        22.86
   37683.199     0.962500        79705        26.67
   38666.239     0.968750        80235        32.00
   39124.991     0.971875        80486        35.56
   39845.887     0.975000        80748        40.00
   40566.783     0.978125        81008        45.71
   41451.519     0.981250        81259        53.33
   42598.399     0.984375        81520        64.00
   43155.455     0.985938        81651        71.11
   43646.975     0.987500        81776        80.00
   44072.959     0.989062        81906        91.43
   44630.015     0.990625        82032       106.67
   45252.607     0.992188        82165       128.00
   45613.055     0.992969        82226       142.22
   46006.271     0.993750        82297       160.00
   46399.487     0.994531        82355       182.86
   47153.151     0.995313        82419       213.33
   47808.511     0.996094        82488       256.00
   48168.959     0.996484        82522       284.44
   48431.103     0.996875        82553       320.00
   48824.319     0.997266        82582       365.71
   49381.375     0.997656        82617       426.67
   49807.359     0.998047        82648       512.00
   50167.807     0.998242        82665       568.89
   50397.183     0.998437        82679       640.00
   50724.863     0.998633        82694       731.43
   50954.239     0.998828        82710       853.33
   51314.687     0.999023        82727      1024.00
   51544.063     0.999121        82735      1137.78
   51675.135     0.999219        82743      1280.00
   51773.439     0.999316        82751      1462.86
   51871.743     0.999414        82759      1706.67
   52068.351     0.999512        82767      2048.00
   52166.655     0.999561        82771      2275.56
   52330.495     0.999609        82777      2560.00
   52428.799     0.999658        82780      2925.71
   52625.407     0.999707        82783      3413.33
   53116.927     0.999756        82789      4096.00
   53116.927     0.999780        82789      4551.11
   53379.071     0.999805        82791      5120.00
   53739.519     0.999829        82793      5851.43
   54165.503     0.999854        82796      6826.67
   54263.807     0.999878        82797      8192.00
   54394.879     0.999890        82798      9102.22
   54853.631     0.999902        82799     10240.00
   55312.383     0.999915        82800     11702.86
   56131.583     0.999927        82801     13653.33
   56295.423     0.999939        82802     16384.00
   56426.495     0.999945        82803     18204.44
   56426.495     0.999951        82803     20480.00
   56492.031     0.999957        82805     23405.71
   56492.031     0.999963        82805     27306.67
   56492.031     0.999969        82805     32768.00
   56492.031     0.999973        82805     36408.89
   56492.031     0.999976        82805     40960.00
   57016.319     0.999979        82806     46811.43
   57016.319     0.999982        82806     54613.33
   57016.319     0.999985        82806     65536.00
   57016.319     0.999986        82806     72817.78
   57016.319     0.999988        82806     81920.00
   57180.159     0.999989        82807     93622.86
   57180.159     1.000000        82807          inf
#[Mean    =    17421.452, StdDeviation   =    10220.488]
#[Max     =    57147.392, Total count    =        82807]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99051 requests in 1.00m, 18.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 8
  Non-2xx or 3xx responses: 1096
Requests/sec:   1651.27
Transfer/sec:    323.72KB